<?
/**
 * 定义应用所需常量
 */
$define = array(
	//认证审核
    'APPROVE_STATUS' => array(
        '1'  => '认证中',
        '2'  => '审核通过',
		'3'  => '审核未通过',
		'4'  => '未认证',
    ),

	//认证方式
    'APPROVE_TYPE' => array(
        '1'  => '邮箱',
        '2'  => '资质',
		'3'  => '未认证',
    ),
	//来源渠道
    'SOURCE' => array(
        '1'  => '管家',
        '2'  => '顾问',
		'3'  => '其他',
		'4'  => '展示页',
    ),
	//销售状态
    'DEAL_STATUS' => array(
        '1'  => '洽谈中',
        '2'  => '已成交',
		'3'  => '已立案',
		'4'  => '交易关闭',
		'5'  => '无',
    ),
	
	//销售状态
    'BUY_STATUS' => array(
		'5'  => '洽谈中未匹配',
        '1'  => '洽谈中',
        '2'  => '已成交',
		'3'  => '已立案',
		'4'  => '交易关闭',
		'6'  => '无',
    ),
	//1-45分类
    'CLASSES' => array(
		'1'   => '化工原料',
        '2'   => '颜料油漆',
		'3'   => '日化用品',
		'4'   => '燃料油脂',
		'5'   => '医药',
		'6'   => '金属材料',
		'7'   => '机械设备',
		'8'   => '手工器械',
		'9'   => '电子电脑',
		'10'  => '医疗器械',
		'11'  => '家用电器',
		'12'  => '运输工具',
		'13'  => '军火烟火',
		'14'  => '珠宝钟表',
		'15'  => '乐器',
		'16'  => '办公用品',
		'17'  => '橡胶制品',
		'18'  => '皮革皮具',
		'19'  => '建筑材料',
		'20'  => '家具',
		'21'  => '厨房洁具',
		'22'  => '绳网蓬袋',
		'23'  => '纺织纱线',
		'24'  => '布料床单',
		'25'  => '服装鞋帽',
		'26'  => '花边衬料',
		'27'  => '地毯席垫',
		'28'  => '运动用品',
		'29'  => '食品',
		'30'  => '方便食品',
		'31'  => '种籽花木',
		'32'  => '啤酒饮料',
		'33'  => '酒',
		'34'  => '烟草烟具',
		'35'  => '广告商务',
		'36'  => '金融物管',
		'37'  => '建筑修理',
		'38'  => '通讯服务',
		'39'  => '运输贮藏',
		'40'  => '材料加工',
		'41'  => '教育娱乐',
		'42'  => '科学服务',
		'43'  => '餐饮住宿',
		'44'  => '医疗园艺',
		'45'  => '社会服务',
    ),
	
	//行业大分类
    'CATEGORY' => array(
		'1'  => '服装鞋帽',
        '2'  => '日化用品',
        '3'  => '家用电器',
		'4'  => '食品',
		'5'  => '酒',
		'6'  => '皮革皮具',
		'7'  => '医用药品',
    ),
	
    'ISSURE' => array(
		'1'  => '否',
        '2'  => '是',
    ),
    'AREA' => array(
		'1'  => '国内',
        '2'  => '国外',
    ),

	
	//商标类型
    'TYPES' => array(
		'1'  => '中文',
        '2'  => '英文',
        '3'  => '图形',
		'4'  => '中+英',
		'5'  => '中+图',
		'6'  => '英+图',
		'7'  => '中+英+图',
        '7'  => '数字',
    ),
	
	//指导价格浮动比例
    'FLAOT_RATIO' => array(
		'1'  => 1,
        '2'  => 0.8,
        '3'  => 0.6,
		'4'  => 0.5,
		'5'  => 0.4,
		'6'  => 0.3,
		'7'  => 0.1,
		'8'  => 0,
    ),
	
	//出售搜索底价
    'SEARCH_PRICE' => array(
		'1'  => array(1,20000,'2万以下'),
        '2'  => array(20000,50000,'2-5万'),
		'3'  => array(50000,100000,'5-10万'),
		'4'  => array(100000,200000,'10-20万'),
		'5'  => array(200000,500000,'20-50万'),
		'6'  => array(500000,1000000,'50-100万'),
		'7'  => array(1000000,10000000000000,'100万以上'),
		'8'  => array(0,0,'面议'),
    ),

	'IMAGE_HOST' => 'http://tr.chofn.net/',
    'COOKIE_PREFIX' => 'tw_',//网站cookie前缀
    'PUBLIC_USER' => 'ChOfNuSeR',//公用用户登录信息标识
    'PUBLIC_USER_TIME' => 1800,//用户登录信息有效时间

);


return $define;

?>